bpel-service/xts_subordinate_wsba/bpel/src/test/resources/xml/soap-order-request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:pp="http://www.jboss.org/bpel/examples/pp">
   <soapenv:Header/>
   <soapenv:Body>
      <pp:orderRequestType>
         <id>4</id>
      </pp:orderRequestType>
   </soapenv:Body>
</soapenv:Envelope>